import 'package:tasbeeh_app/model/asma_model.dart';

class AsmaList {
  final List<AsmaModel> asmaList = [
    AsmaModel(
      id: 1,
      duaCat: 'রিজিক',
      duaName: 'রব্বি ইন্নি লিমা আনজালতা ইলাইয়া মিন খাইরিন ফাকির',
      duaArabic: 'رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ',
      duaMeaning:
          'হে আমার রব! আপনি যা আমার দিকে অবতীর্ণ করেছেন, আমি তার জন্য একান্ত দরিদ্র।',
      duaIdentity: 'আল-কাসাসঃ ২৪',
    ),

    AsmaModel(
      id: 2,
      duaCat: 'সৎ জীবনসঙ্গী এবং সন্তান',
      duaName:
          'রব্বানা হাবলানা মিন আজওয়াজিনা ওয়া ধুররিয়্যাতিনা কুররাতা আয়ুনিন ওয়াজ’আলনা লিলমুত্তাকীনা ইমামা',
      duaArabic:
          'رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا',
      duaMeaning:
          'হে আমাদের পালনকর্তা, আমাদের স্ত্রীদের পক্ষ থেকে এবং আমাদের সন্তানের পক্ষ থেকে আমাদের জন্য চোখের শীতলতা দান কর এবং আমাদেরকে মুত্তাকীদের নেতা বানিয়ে দাও।',
      duaIdentity: 'সুরা আল-ফুরকানঃ ৭৪',
    ),

    AsmaModel(
      id: 3,
      duaCat: 'সন্তানসন্ততি',
      duaName: 'রাব্বি হাবলি মিনাস সালেহীন',
      duaArabic: 'رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ',
      duaMeaning: 'হে আমার রব! আমাকে সৎকর্মশীলদের অন্তর্ভুক্ত থেকে দান করুন।',
      duaIdentity: 'সূরা আস-সাফফাতঃ ১০০',
    ),

    AsmaModel(
      id: 4,
      duaCat: 'অসুস্থ ব্যক্তির জন্য দোয়া',
      duaName:
          'আল্লাহুম্মাশফি ‘আবদাকা ইয়ানকুঅ লাকা ‘আদুয়্যান, আও ইয়ামশিয়া লাকা ইলা সালাহ',
      duaArabic:
          'اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكُأْ لَكَ عَدُوًّا، أَوْ يَمْشِيَ لَكَ إِلَى صَلَاةٍ',
      duaMeaning:
          'হে আল্লাহ, তুমি তোমার বান্দাকে সুস্থ করে দাও। যাতে সে তোমার শত্রুকে ক্ষতি করতে পারে অথবা তোমার দিকে (মসজিদে) নামাজ পড়তে যেতে পারে।',
      duaIdentity: 'সুনান আবু দাউদ (সংখ্যা: ১৫০৪)',
    ),

    AsmaModel(
      id: 5,
      duaCat: 'বিজয়',
      duaName: 'রাব্বি ইন্নি মাগলুবুন ফানতাসির',
      duaArabic: 'رَبِّ إِنِّي مَغْلُوبٌ فَانْتَصِرْ',
      duaMeaning: 'হে আমার প্রতিপালক, আমি পরাজিত, তাই আমাকে সাহায্য করুন।',
      duaIdentity: 'সুরা আল-কামার',
    ),

    AsmaModel(
      id: 6,
      duaCat: 'ঈমান রক্ষার জন্য দু‘আ',
      duaName:
          'রাব্বানা লা তুযিগ্ ক্বুলুবানা বা’দা ইয্ হাদায়তানা ওয়া হাব্‌লানা মিল্লা দুনকা রাহমাহ্ ইন্নাকা আংতাল ওয়াহ্‌হাব।',
      duaArabic:
          'رَبَّنَا لَا تُزِغۡ قُلُوۡبَنَا بَعۡدَ اِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِنۡ لَّدُنۡكَ رَحۡمَةً ‌ ۚ اِنَّكَ اَنۡتَ الۡوَهَّابُ',
      duaMeaning:
          'হে আমাদের প্রতিপালক! সরল পথ-প্রদর্শনের পর তুমি আমাদের অন্তরকে সত্য লঙ্ঘন বা বক্র করো না এবং তোমার নিকট থেকে আমাদেরকে করুণা দান কর। নিশ্চয়ই তুমি মহা দাতা।',
      duaIdentity: 'সুরা আ-লু-ইমরানঃ ৮',
    ),

    AsmaModel(
      id: 7,
      duaCat: 'ইব্রাহীম (আঃ) দোয়া',
      duaName:
          'রাব্বানা তাক্বাব্বাল মিন্না ইন্নাকা আংতাস্ সামী‘ঊল ‘আলীম। ওয়াতুব্ ‘আলাইনা, ইন্নাকা আন্তাত্ তাওয়্যা-বুর রাহিম',
      duaArabic:
          'رَبَّـنَـا  تَـقَـبَّـلْ  مِـنَّـا  ط  اِنَّـكَ  اَنْـتَ  السَّـمِـيْـعُ  الْـعَـلِـمُ  وَتُـبْ عَـلَـيْـنَـا ج اِنَّـكَ اَنْـتَ الـتَّـوَّابُ الرَّحِـيْـمُ',
      duaMeaning:
          'হে আমাদের প্রতিপালক! আমাদের এ কাজকে তুমি কবুল কর, নিশ্চয়ই তুমি সর্বশ্রোতা, সর্বজ্ঞাত; এবং আমাদের প্রতি ক্ষমাশীল হও। তুমিতো অত্যন্ত ক্ষমাশীল, পরম দয়ালু।',
      duaIdentity: 'সুরা বাকারাঃ ১২৭',
    ),

    AsmaModel(
      id: 8,
      duaCat: 'চিন্তামুক্ত সফরের দু’আ',
      duaName:
          'রাব্বি আদ্‌খিল্‌নি মুদ্‌খালা সিদক্বিওঁ ওয়া আখ্‌রিযনি মুখ্‌রাজা সিদ্‌কিওঁ ওয়াজা’আল্লি মিল্লাদুন্‌কা সুল্‌তা-নান্ন নাসি-র।',
      duaArabic:
          'رَّبِّ  اَدْخِـلْـنِـىْ  مُـدْخَـلَ  صِـدْقٍ  وَّاَخْـرِجْـنِـىْ  مُـخْـرَجَ  صِـدْقٍ  وَّاجْـعَـلْ  لِّـىْ  مِـنْ  لَّـدُنْـكَ سُلْطَانًا نَصِيرًا',
      duaMeaning:
          'হে আমার প্রতিপালক! আমাকে প্রবেশ করাও কল্যাণের সাথে এবং আমাকে নিষ্ক্রান্ত করাও কল্যাণের সাথে এবং তোমার নিকট হতে আমাকে দান করো সাহায্যকারী শক্তি।',
      duaIdentity: 'সূরা বানী ইসরাঈলঃ ৮০',
    ),

    AsmaModel(
      id: 9,
      duaCat: 'ক্ষমার জন্য দু’আ',
      duaName: 'রাব্বিগ্‌ফির ওয়ারহাম ওয়া আংতা খাইরুর রাহিমিন',
      duaArabic:
          'رَبِّ  اغْـفِـرْ  وَارْحَـمْ  وَاَنْـتَ  خَـيْـرُ  الرّٰحِـمِـيْـنَ',
      duaMeaning:
          'হে আমার রব! মাফ কর, রহম কর, তুমি সব দয়াবানের চেয়ে অতি উত্তম দয়াবান।',
      duaIdentity: 'সূরা মুমিনুনঃ ১১৮',
    ),
  ];
}
