import 'package:tasbeeh_app/model/tasahud_model.dart';

class TasahudList {
  final List<TasahudModel> tasahudList = [
    TasahudModel(
      id: 1,
      tCat: 'তাশাহুদ',
      tName:
          'আত্তাহিইয়াতু লিল্‌লাহি ওয়াস্‌ সালাওয়াতু ওয়াত্ ত্বাইয়িবাত। আসসালামু ‘আলায়কা আইয়ুহান নাবিইয়ু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহ্‌। আস্‌সালামু ‘আলায়না ওয়া ‘আলা ‘ইবাদিল্লাহিস্‌ সালিহীন। আশ্‌হাদু আল লা ইলাহা ইল্লাল্লাহু ওয়া আশ্‌হাদু আন্না মুহাম্মাদান ‘আব্‌দু ওয়া রাসুলুহ্‌।',
      tArabic:
          'اَلتَّحِيَّاتُ لِلّٰهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهٗ، السَّلاَمُ عَلَيْنَا وَعَلٰى عِبَادِ اللّٰهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لاَّ إِلٰهَ إِلاَّ اللّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهٗ وَرَسُوْلُهٗ',
      tMeaning:
          'যাবতীয় সম্মান, যাবতীয় উপাসনা ও যাবতীয় পবিত্র বিষয় আল্লাহর জন্য। হে নবী! আপনার উপরে শান্তি বর্ষিত হউক এবং আল্লাহর অনুগ্রহ ও সমৃদ্ধি নাযিল হউক। শান্তি বর্ষিত হউক আমাদের উপরে ও আল্লাহর সৎকর্মশীল বান্দাগণের উপরে। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত কোনো উপাস্য নেই এবং আমি সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ তাঁর বান্দা ও রাসুল।',
      tIdentity: 'সহীহ মুসলীমঃ ৭৮৪, সুনান ইবন মাজাঃ ৯০১',
    ),

    TasahudModel(
      id: 2,
      tCat: 'দুরূদে ইব্রাহিম',
      tName:
          ' আল্লাহুম্মা সাল্লি আ’লা মুহাম্মাদিওঁ ওয়া আ’লা আলি মুহাম্মাদিন কামা সাল্লাইতা আ’লা ইব্‌রাহীমা ওয়া আ’লা আলি ইব্‌রাহীমা ইন্নাকা হামীদুম্ মাজীদ, আল্লাহুম্মা বারিক আ’লা মুহাম্মাদিওঁ ওয়া আ’লা আলি মুহাম্মাদিন কামা বারাক্‌তা আ’লা ইব্রাহীমা ওয়া আ’লা আলি ইব্রাহীমা ইন্নাকা হামীদুম্ মাজীদ।',
      tArabic:
          'اللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ وَّعَلٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلٰى إِبْرَاهِيْمَ وَعَلٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَّجِيْدٌ .. اَللّٰهُمَّ بَارِكْ عَلٰى مُحَمَّدٍ وَّعَلٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلٰى إِبْرَاهِيْمَ وَعَلٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَّجِيْدٌ',
      tMeaning:
          'হে আল্লাহ! আপনি আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু তাআলা আলাইহি ওয়াসাল্লাম ও তাঁর পরিজনের প্রতি রহমত বর্ষণ করুন, যেভাবে বর্ষণ করেছেন ইব্রাহীম (আঃ) ও তাঁর এর পরিজনের প্রতি, নিশ্চই আপনি প্রশংসিত ও সম্মানিত। হে আল্লাহ! আপনি বরকত নাযিল করুন, আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু তাআলা আলাইহি ওয়াসাল্লাম ও তাঁর পরিজনের প্রতি যেভাবে আপনি বরকত নাযিল করেছেন ইব্রাহীম (আঃ) ও তাঁর এর পরিজনের প্রতি, নিশ্চই আপনি প্রশংসিত ও সম্মানিত।',
      tIdentity: 'সহীহ বুখারী- ২ঃ৯৪০',
    ),

    TasahudModel(
      id: 3,
      tCat: ' দু’আ-ই মাসুরাহ',
      tName:
          'আল্লাহুম্মা ইন্নী যালামতু নাফ্‌সি যুলমান কাছীরাঁও ওয়ালা ইয়াগ্‌ফিরুয যুনূবা ইল্লা আন্ত, ফাগ্‌ফিরলি মাগফিরাতাম মিন ‘ইনদিক, ওয়ারহাম্‌নি ইন্নাকা আন্তাল গাফূরুর রহীম।',
      tArabic:
          'اَللَّهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا وَّلاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِيْ مَغْفِرَةً مِّنْ عِنْدِكَ وَارْحَمْنِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ',
      tMeaning:
          'হে আল্লাহ! আমি আমার নফসের উপরে অসংখ্য জুলুম করেছি। ঐসব গুনাহ মাফ করার কেউ নেই আপনি ব্যতীত। অতএব আপনি আমাকে আপনার পক্ষ হতে বিশেষভাবে ক্ষমা করুন এবং আমার উপরে অনুগ্রহ করুন। নিশ্চয়ই আপনি ক্ষমাশীল ও দয়াবান।',
      tIdentity: 'সহীহ বুখারীঃ ৮৩৪, সহীহ মুসলীমঃ ৬৮৬৯',
    ),

    TasahudModel(
      id: 4,
      tCat: 'দু’আ-ই কুনুত',
      tName:
          'আল্লাহুম্মা ইন্না নাসতাঈনুকা ,ওয়া নাসতাগ্‌ফিরুকা,ওয়া নু’মিনুবিকা, ওয়া নাতাওয়াক্কালু আলাইকা, ওয়ানুসনি আলাইকাল খাইর, ওয়া নাশকুরুকা , ওয়া লানাকফুরুকা, ওয়া নাখলাউ ওয়া নাতরুকু, মাই ইয়াফ জুরুকা, আল্লাহুম্মা ইয়্যাকানা’বুদু , ওয়া লাকানুছল্লি, ওয়া নাসজুদু, ওয়া ইলাইকা নাসআ, ওয়া নাহফিদু, ওয়া নারজু রহমাতাকা, ওয়া নাখশা আযাবাকা, ইন্না আযাবাকা বিলকুফ্‌ফারি মুলহিক।',
      tArabic:
          'اَللّٰهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُؤْمِنُ بِكَ، وَ نَتَوَكَّلُ عَلَیْكَ وَنُثْنِيْ عَلَیْكَ الْخَيْرَ وَنَشْكُرُكَ وَلَا نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَّفْجُرُكَ، اَللّٰهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّيْ وَنَسْجُدُ، وَإِلَيْكَ نَسْعٰى وَنَحْفِدُ، وَنَرْجُوْ رَحْمَتَكَ، وَنَخْشٰى عَذَابَكَ، إِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ',
      tMeaning:
          'হে আল্লাহ! আমরা আপনারই সাহায্যপ্রার্থী এবং একমাত্র আপনার কাছেই ক্ষমাপ্রার্থী। আপনার উপর আমরা ঈমান এনেছি এবং আপনার উপরই ভরসা করি, আপনার উত্তম প্রশংসা করি, আপনার শোকর আদায় করি, আপনার প্রতি অকৃতজ্ঞ হই না, যারা আপনার নাফরমানী করে, তাদেরকে পরিত্যাগ করি এবং তাদের সঙ্গে সম্পর্ক ছিন্ন করি। হে আল্লাহ! আমরা আপনারই ইবাদাত করি, আপনার জন্যই নামাজ পড়ি এবং আপনার জন্যই সিজদা করি, আপনার দিকেই ধাবিত হই, আপনার হুকুম পালনের জন্যই প্রস্তুত থাকি, আপনার দয়ার আশা করি, এবং আমরা আপনার আযাবকে ভয় করি। নিশ্চাই আপনার প্রকৃত আযাব কাফেরদের উপর পতিত হবে।',
      tIdentity: 'ইবনে আবী শাইবাঃ ৬৯৬৫',
    ),

    TasahudModel(
      id: 5,
      tCat: 'দু’আ-ই মাসুরাহ #২',
      tName:
          'আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা মিন ‘আযা-বিল ক্বাবরি ওয়া মিন ‘আযা-বি জাহান্নামা, ওয়া মিন ফিতনাতিল মাহ্ইয়া ওয়াল মামা-তি, ওয়া মিন শাররি ফিতনাতিল মাসীহিদ দাজ্জা-ল',
      tArabic:
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ',
      tMeaning:
          'হে আল্লাহ! আমি তোমার নিকট আশ্রয় প্রার্থনা করছি জাহান্নামের আযাব থেকে, কবরের আযাব থেকে, জীবন-মৃত্যুর ফিতনা থেকে এবং মাসীহ দাজ্জালের অনিষ্ট থেকে।',
      tIdentity: 'সহীহ মুসলীমঃ ১২০২',
    ),

    TasahudModel(
      id: 6,
      tCat: 'কুনুত-ই-নাযেলা',
      tName:
          'আল্লা-হুম্মাহদিনী ফীমান হাদাইতা ওয়া ‘আ-ফিনী ফীমান ‘আ-ফাইতা ওয়া তাওয়াল্লানী ফীমান তাওয়াল্লাইতা ওয়াবা-রিক লী ফীমা আ‘ত্বাইতা ওয়াক্বিনী শাররা মা ক্বাদাইতা ফাইন্নাকা তাক্ব‌্দ্বী ওয়ালা ইউক্ব্‌দ্বা ‘আলাইকা। ওয়া ইন্নাহু লা ইয়াযিল্লু মাও ওয়া-লাইতা, ওয়ালা ইয়া‘ইয্যু মান ‘আ-দাইতা। তাবা-রক্‌তা রব্বানা ওয়া তা‘আ-লাইতা',
      tArabic:
          'اَللَّهُمَّ اهْدِنِيْ فِيْمَنْ هَدَيْتَ، وَعَافِنِيْ فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِيْ فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِيْ فِيْمَا أَعْطَيْتَ، وَقِنِيْ شَرَّمَا قْضَيْتَ؛ إِنَّكَ تَقْضِىْ وَلاَ يُقْضَى عَلَيْكَ، وَإنَّهُ لاَ يَذِلُّ مَنْ وَّالَيْتَ، وَلاَ يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ',
      tMeaning:
          'হে আল্লাহ! আপনি যাদেরকে সুখদায়ক সৎ পথ প্রকৃত ইসলামের অনুগামী করেছেন, আমাকেও তাদের অন্তর্ভুক্ত করুন। আপনি যাদেরকে সুখশান্তিপূর্ণ মঙ্গলময় জীবন প্রদান করেছেন, আমাকেও তাদের অন্তর্ভুক্ত করুন। আপনি যাদেরকে সর্ব প্রকার কল্যাণ প্রদানের সহিত সাহায্য করেছেন, আমাকেও তাদের অন্তর্ভুক্ত করুন। আপনি আমাকে যে সমস্ত মঙ্গলদায়ক জিনিস প্রদান করেছেন, সেগুলিকে আমার জন্য অধিকতর মঙ্গলদায়ক করুন। আপনি যে ফয়সালা করেছেন, তার অমঙ্গল হতে আমাকে রক্ষা করুন। কেননা সব জগতের সঠিক পরিচালনার জন্য যে ফয়সালা আপনি করেছেন, সেটাই সঠিক ফয়সালা। তাই আপনার ফয়সালার উপরে আর কোনো প্রকারের সঠিক ফয়সালা নেই। আপনি যাকে ভালো বাসবেন, সে কোনো দিন অপমানিত হতে পারে না। আর আপনি যার জন্য অমঙ্গল নির্ধারণ করবেন, সে কোনো দিন শক্তিশালী হতে পারবে না। হে আমাদের প্রতিপালক! আপনি মহাকল্যাণময় এবং মহামহিমান্বিত',
      tIdentity: 'সুনানে আবু দাউদঃ ১৪২৫',
    ),

    TasahudModel(
      id: 7,
      tCat: 'ইস্তেখারা',
      tName:
          'আল্লাহুম্মা ইন্নী আসতাখিরুকা বি‘ইলমিকা ওয়া আস্তাক্বদিরুকা বিক্বুদ্‌রাতিকা ওয়া আস্আলুকা মিন ফাদ্‌লিকাল আযীম। ফা ইন্নাকা তাক্বদিরু ওয়ালা আক্বদিরু, ওয়া তা’লামু ওয়ালা আ’লামু, ওয়া আনতা ’আল্লামূল গুয়ূব। আল্লাহুম্মা ইন কুনতা তা’লামু আন্না হা-যাল আম্‌রা (মনে মনে প্রয়োজন উল্লেখ করুন) খাইরুন লী ফী দীনি ওয়া মা’আশী ওয়া ‘আ-ক্বিবাতি আমরী , ফাকদিরহু লী, ওয়া ইয়াস্‌সিরহু লী, ছুম্মা বারিক লী ফীহি। ওয়া ইন কুনতা তা’লামু আন্না হা-যাল আমরা (মনে মনে প্রয়োজন উল্লেখ করুন) শাররুন লী ফী দীনী ওয়া মা’আ-শী ওয়া ’আ-ক্বিবাতি আমরী, ফাসরিফহু ’আন্নী ওয়াসরিফনী ’আনহু, ওয়াকদুর লিয়াল-খাইর। হাইসু কা-না, সুম্মা আরদ্বিনী বিহ্',
      tArabic:
          'اللّٰهُمَّ إِنِّيْ أَسْتَخِيْرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ وَتَعْلَمُ وَلاَ أَعْلَمُ وَأَنْتَ عَلاَّمُ الْغُيُوْبِ، اللّٰهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الأَمْرَ خَيْرٌ لِيْ فِيْ دِيْنِيْ وَمَعَاشِىْ وَعَاقِبَةِ أَمْرِيْ فَاقْدُرْهُ لِيْ وَيَسِّرْهُ لِيْ ثُمَّ بَارِكْ لِيْ فِيْهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الأَمْرَ شَرٌّ لِيْ فِيْ دِيْنِيْ وَمَعَاشِىْ وَعَاقِبَةِ أَمْرِيْ فَاصْرِفْهُ عَنّيْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِيْ بِهٖ.',
      tMeaning:
          'হে আল্লাহ! আমি আপনার ইলমের উসিলায় আপনার নিকট মঙ্গল কামনা করছি এবং আপনার কুদরতের উসিলায় আপনার নিকট শক্তি কামনা করছি এবং আপনার নিকট আপনার মহান অনুগ্রহ কামনা করছি। কেননা, আপনি ক্ষমতাবান, আর আমি অক্ষম এবং আপনি সর্বজ্ঞানী আর আমি অজ্ঞ, এবং আপনি সমস্ত গোপন সম্পর্কে জ্ঞাত। হে আল্লাহ! যদি আপনার জ্ঞান অনুযায়ী এ কাজটি আমার জন্য আমার দ্বীন ও দুনিয়ার দিক দিয়ে এবং পরিণামে মঙ্গলজনক হয়, তবে তা আমার জন্য নির্ধারণ করে দিন এবং একে সহজ করে দিন। অতঃপর এর মধ্যে আমার জন্য বরকত দান করুন। আর যদি আপনার জ্ঞান অনুযায়ী এ কাজটি আমার দ্বীন ও দুনিয়ার দিক দিয়ে এবং পরিণামে আমার জন্য মঙ্গলজনক না হয়, তবে আপনি এ কাজটিকে আমার থেকে দূরে রাখুন এবং যেখানেই আমার জন্য মঙ্গল রয়েছে তা আমার জন্য নির্ধারিত করুন এবং তাতেই আমাকে সন্তুষ্ট করে দিন।',
      tIdentity: 'সহীহ বুখারীঃ ৫৯৪০, আবু দাউদঃ ১/২১৫',
    ),
  ];
}
